# CalculateLengthPerArea Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..CalculateLengthPerArea Method
FillGrid Class See Also
---
Calculates length of the pattern per unit area.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double CalculateLengthPerArea()
```

Visual Basic
---
```text
Public Function CalculateLengthPerArea As Double
```

Visual C++
---
```text
public:
double CalculateLengthPerArea()
```

# ### Return Value
The length per area.
# See Also
FillGrid Class
Autodesk.Revit.DB Namespace